{"table":"arctype","typeName":"Церкви та монастирі","id":1,"_id":"4bZorEfF62YSLHr7"}
{"table":"arcobj","objName":"Вірменська церква","descr":"Вірменську церкву збудовано в 1363–1370 роках майстром Дорінгом між вищою та нижчою Вірменськими вулицями. Протягом століть вона була громадським і релігійним центром вірменської колонії у Львові. Вплив вірменської архітектури позначився на формі дванадцятигранного барабана з шатровим дахом, що вивершує середохрестя. Він виявляється в ретельному оздобленні стін тесаними кам'яними плитами з вмонтованими в них хачкарами, в рисунку сталактитового фриза над аркою центральної апсиди. Останній був прикрашений властивим для давньоруських пам'яток фресковим розписом (XV століття).","curaddr":"вул.Вірменська, 7/13.","image":"Armenian Church.png","id":1,"type_id":1,"_id":"53MESTK96O3mjI2y"}
{"table":"arcobj","objName":"Королівський арсенал","descr":"Зведений у 1639–1646 рр. арсенал дістав назву Королівського, оскільки 2/3 вартості будівництва сплатив король Владислав IV Ваза. Арсенал використовувався як склад міської зброї і виконував свої безпосередні функції до 1768 р. При арсеналі також діяли ливарня, у котрих відливали зброю та дзвони, а також різні майстерні. Як і Міський арсенал, Королівський був прибудований до Високого муру і входив до системи укріплень. У разі штурму арсенал ставав пасткою для тих, хто увірветься у двір, бо кожна точка подвір'я прострілюється з вікон. Будинок зведено з каменю, є прямокутним у плані з двома L-подібними крилами, з'єднані стіною. Ці стіни зі східного боку оточують внутрішнє подвір'я. Фасад, котрий виходить на площу перед арсеналом прикрашений лоджією і бароковим фронтоном. На бічному фасаді східного крила зберігся різьблений кам'яний портал у стилі ренесанс.","curaddr":"вул.Підвальна, 13.","image":"King Arsenal.png","id":14,"type_id":2,"_id":"6mwv8ATUgoTUuyt8"}
{"table":"arctype","typeName":"Цивільна архітектура","id":3,"_id":"8Wmz2AFCnYZBndLr"}
{"table":"arcobj","objName":"Успенська церква","descr":"Побудований Успенським братством храм мав трьох своїх попередників. Перша Успенська церква існувала, можливо, ще за княжих часів і була спалена під час нападу на Львів польських феодалів у 1340 р. Друга, мурована церква, перша згадка про неї відноситься до 1421 р., проіснувала до пожежі 1527 р. Зруйнований пожежею храм відбудовує у 1547–1559 р. архітектор Петро Італієць — уродженець міста Лугано. Кошти на його спорудження дав молдавський господар Олександр Лопушанин. Вона також недовго простояла, згорівши при пожежі 1571 р. Будівництво четвертої Успенської церкви, яка збереглась донині, братство розпочало в 1591 р. Автором проекту і керівником будівельних робіт був Павло Римлянин. З 1597 р. йому допомагав Войтіх Капінос, через рік приєднався Амброзій Прихильний. Спочатку церкву мурували з цегли, але після зведення частини мурів братство прийняло рішення замінити цеглу на тесаний камінь. Будівництво храму закінчили 1629 року. Структура церкви витримана у стилі італійського ренесансу, але на основі традицій українського будівництва. На осі захід-схід — тридільна і триверха, як основний тип українських дерев'яних церков. Стіни розчленовані пілястрами, з арками вікон і плоскорізьбами на метопах, різьбленими одвірками північних і південних дверей, а на парусах угорі вирізьблені герби жертводавців; різьбарські роботи виконали львівські різьбарі Костянтин і Яків Кульчицькі. Успенська церква — це тринавна базиліка, видовжена вздовж вул. Руської, з півкруглою апсидою, що виступає в бік вул. Підвальної. Храм увінчують три бані з ліхтарями; центральна баня спочиває на підпружних арках, підтримуваних чотирма тосканськими колонами. У такій планувально-об'ємній структурі прослідковується злиття західної ренесансної та української будівельних традицій. Перша проявилася у базилікальному плані й архітектурному декорі, друга — в традиційних купольних завершеннях. Зовні стіни відповідно до внутрішнього планування розчленовані тосканськими пілястрами на симетричні площини, у яких прорізані віконні отвори (з 4-ма вікнами вдолі і 8-ма в так званій ліхтарні, прикрашена розетами; під нею герби молдавського воєводи Мирона Бернавського-Могили, царя Фьодора Івановіча (ктиторів храму), короля Сігізмунда ІІІ Вази з архівольтами. Фасад завершено розвиненим антаблементом, компонентом якого є дорійський фриз з метопами, тригліфами та розетами. У полях метопів розміщено рельєфні, різьблені в камені композиції на біблійні та євангельські теми. В інтер'єрі храму, що складається з трьох просторових об'ємів — бабинця, головної нави та вівтарної частини, — основну естетичну роль відіграє матеріал — білий тесаний камінь при лаконічній архітектурній пластиці колон, арок, пілястр. Центральний купол, основою якого служить доричний фриз, оздоблений кесонами з розетками. В його парусах вміщено різьблені в камені герби жертводавців, які давали кошти на будівництво храму. Основою двох інших куполів — у бабинці та вівтарній частині, служить дорійський фриз з метопами та тригліфами. Стіни, як і зовні, розчленовані пілястрами, а архітектурне рішення інтер'єру збагачують два марші сходів, що ведуть на бокові галереї при північній та південній стінах. Світло в церкву потрапляє через високі вікна, оздоблені вітражами львівського художника першої третини XX ст. Петра Холодного. На стінах залишились зразки станкового живопису XVII ст.","curaddr":"вул.Підвальна, 9.","image":"Assumption Church.png","id":3,"type_id":1,"_id":"9AnDOaMfdEHqgBCI"}
{"table":"arcobj","objName":"Церква Святого Юра","descr":"Перший дерев’яний храм, присвячений святому Юрієві, заклав у 1280 році король Лев Данилович для волинського князя Василька. У 1340 році польський король Казимир III разом із чисельним військом спалив княжий Львів, в тому числі перший дерев’яний храм святого Юрія та монастир. Ровесницею першої кам’яної церкви св. Юрія є Вірменська церква (частково мурована з цегли, частково — дерев’яна). Обидва храми збудував один і той самий майстер. У національному та релігійному житті Львова, Галичини й цілої Русі-України особливу роль відіграв боярський рід Шептицьких. Перший із цього роду — визначний Митрополит Атанасій (1715-1746) – розпочав будову нового величного храму у Львові на місці середньовічної Святоюрської церкви. 1744 року було закладено фундамент нової церкви. Головним проектантом і будівничим Святоюрського храму став німець Бернард Меретині. Будівництво собору було закінчено в 1764 році, але декоративні роботи тривали аж до 1780 року. Основним компонентом архітектурного ансамблю пізнього бароко є катедральний собор. До нього входять митрополичі палати, капітульні будинки, дзвіниця, владичий сад, огорожі. Монументальні аркоподібні ворота ведуть на подвір’я собору святого Юра. Фігурне обрамлення воріт оздоблено постатями святих, які символізують церкву Римську та церкву Грецьку. Цю скульптурну групу створив у 1770 році Михайло Філевич. Між капітульними будинками на кам’яній терасі велично стоїть хрещатий у плані собор, орієнтований вівтарем на захід. Загальна композиція храму має центричний характер. До нього ведуть тесані білокам’яні двомаршові сходи. Сходи з ажурною балюстрадою, оздобленою вісьмома «геніями», котрі сидять (означають різні цноти), і численними кам’яними ліхтарями роботи скульптора Стажевського ведуть до катедри. З обох боків порталу-арки фасаду розміщено дві постаті архиєреїв: Папи Льва VI й Атанасія Великого, Архиєпископа Александрійського (скульптор — Іоанн Пінзель). Скульптурна група «Юрій-Змієборець», що увінчує аттик Собору Святого Юра — теж роботи Іоанна Георгія Пінзеля. Гармонійну цілість фасадів архикатедри підкреслюють вертикальні лінії пілястр, увінчані різьбленими в камені рокайлевими капітелями, та карнизи витончених пропорцій із філігранними профілюваннями. Над перехрестям нав піднімається квадратний підбанник із заокругленими гранями, обведений ажурною балюстрадою з еліптичними люкарнами та прикрашений ліхтарями. Під головною банею чотири пілони підтримують систему склепінь і менші знижені приміщення навколо нави. Ліхтарню бані оповиває така сама балюстрада. Ціла могутня форма головного фасаду вдало поєднує різноманітні деталі архітектурного декору з будівлею: різьблені в камені ліхтарі, ажурні балюстради — усі каменярські роботи виконували Петро Білостоцький і Онуфрій Стефанський.","curaddr":"пл.Святого Юра, 5.","image":"Church of St. George.png","id":9,"type_id":1,"_id":"EYYmYSQljsVpcXSC"}
{"table":"arcobj","objName":"Костел Марії Сніжної","descr":"Вперше згадується у 1344 році. Був храмом німців Львова, при ньому діяла перша парохія римської каталоцької церкви у місті. У XIV-XV століттях Львів оточено оборонним муром, а костел, що опинився за його межами обнесено власним муром товщиною 2 м. В середині XVIIІ століття львівський художник-монументаліст Станіслав Строїнський оздобив святиню фресковими розписами, які, на жаль, до наших днів не збереглися. Також з цього часу у елементах інтер’єру храму збереглася унікальна барокова дерев’яна різьба. Цікавими у внутрішньому убранстві храму постають розписи кінця ХІХ століття живописця Єдварда Лєпшого, які є імітацією мозаїки.","curaddr":"вул.Сніжна, 2.","image":"Church of Mary the Snow.png","id":8,"type_id":1,"_id":"EpyYvZ8sHTzzdwFm"}
{"table":"arcobj","objName":"Чорна кам'яниця","descr":"Чорна кам'яниця — житловий будинок на площі Ринок у Львові, архітектурна пам'ятка. Збудована 1577 року Петром Красовським у стилі ренесансу. У 1875–1877 роках відновлено аттик і портали, 1884-го надбудовано 4-й поверх. Фасад і фланкуючі пілястри вкриті тесаним каменем. Фасад оздоблено орнаментами і сюжетною різьбою. Наприкінці XVI століття представник львівського патриціанського роду Ян Лоренцович відкрив у цьому будинку одну з перших у Львові аптек. Свою назву Чорна кам'яниця одержала у XIX столітті через цілком прозаїчну причину: протягом століть свинцеві білила, які наносилися як ґрунт для поліхромії (багатоколірності), окислювалися під дією повітря і світла і таким чином утворився її таємничий чорний колір.","curaddr":"пл.Ринок, 8.","image":"Black Stone Building.png","id":5,"type_id":3,"_id":"FzPjz9wpOX242yNS"}
{"table":"arcobj","objName":"Церква святого Миколая","descr":"Церква Святого Миколая — памʼятка архітектури національного значення, один із найдавніших храмів Львова. Знаходиться під горою Будельницею на вул. Богдана Хмельницького, 28 г (колишній Волинський тракт). Храм збудований імовірно між 1264 і 1340 роками. Пам'ятка не зберегла свого первозданного вигляду. Від первісної церкви залишилися тільки фрагменти стін. Її змінили ґрунтовні перебудови після пожеж 1623 та 1800 рр., коли згоріли криті ґонтом дахи, купол і вежа-дзвіниця над бабинцем. Церква являє собою своєрідну хрещату в плані споруду з квадратною навою, навколо якої групуються об'єми вівтаря з півкруглою апсидою, прямокутного бабинця і бічних каплиць, також з півкруглими апсидами. Нава і вівтарна частина завершені типовими для української архітектури банями з ліхтарями. Обʼємно-планувальна композиція Миколаївської церкви зближує її з храмами Київської Русі, а також має аналоги в архітектурі південних словʼян. Від будівлі XIII ст. залишилися план, нижня частина камʼяних стін і відкриті з-під тиньку апсиди, вимурувані з тесаних блоків білого вапняку. Сучасна адреса: вул. Богдана Хмельницького, 28А.Церква Святого Миколая — памʼятка архітектури національного значення, один із найдавніших храмів Львова. Знаходиться під горою Будельницею на вул. Богдана Хмельницького, 28 г (колишній Волинський тракт). Храм збудований імовірно між 1264 і 1340 роками. Пам'ятка не зберегла свого первозданного вигляду. Від первісної церкви залишилися тільки фрагменти стін. Її змінили ґрунтовні перебудови після пожеж 1623 та 1800 рр., коли згоріли криті ґонтом дахи, купол і вежа-дзвіниця над бабинцем. Церква являє собою своєрідну хрещату в плані споруду з квадратною навою, навколо якої групуються об'єми вівтаря з півкруглою апсидою, прямокутного бабинця і бічних каплиць, також з півкруглими апсидами. Нава і вівтарна частина завершені типовими для української архітектури банями з ліхтарями. Обʼємно-планувальна композиція Миколаївської церкви зближує її з храмами Київської Русі, а також має аналоги в архітектурі південних словʼян. Від будівлі XIII ст. залишилися план, нижня частина камʼяних стін і відкриті з-під тиньку апсиди, вимурувані з тесаних блоків білого вапняку.","curaddr":"вул. Богдана Хмельницького, 28А.","image":"Church of St. Nicholas.png","id":2,"type_id":1,"_id":"Mko3kUf5dOkfaD10"}
{"table":"arcobj","objName":"Костел кармелітів босих","descr":"1633 року ченці ордену кармелітів босих одержали від міської влади пагорб за валами міських мурів для будівництва храму та монастиря. Зведення комплексу розпочалось у 1634 р. Збудовано костел у стилі раннього бароко, у плані – це правильний прямокутник, який поділений на три нави. Автором проекту був італійський архітектор Ян Покорович. Споруджений храм фундацією брацлавського воєводи князя Олександра Заславського–Острозького та львівського канцлера Александра Куропатви. Ченці переселились в новий монастир у 1642 р. Тоді виникла одна проблема: комплекс кармелітів знаходився далеко від брам міста. Це викликало незручності як в доступі ченців до міста, так і доступі віруючих до костелу. Ченці змогли добитись дозволу короля на утворення проходу в укріпленнях. Хвіртка у зовнішній лінії стін отримала назву Босяцької і була збудована у 1643 році. Зрозуміло, що через загрозу безпеки міста таке рішення викликало спротив у міщан. Король видав новий декрет про будівництво фортифікацій монастиря та прибудову їх до міських. Костел і монастир були дуже добре укріпленими: наприклад, вони змогли витримати турецьку облогу 1672 року. Однак, в 1704 р. монастир захопили шведські війська Карла XII, а потім - через Босяцьку хвіртку – й місто Львів. Як наслідок, місто було пограбовано, на нього шведи ще й наклали контрибуцію. У 1731 р. костел розписував італійський живописець Джузеппе Карло Педретті разом із своїм учнем Бенедиктом Мазуркевичем. До кінця ХVIII ст. в храмі з’явилися дванадцять бічних вівтарів. У 1835 р. спроектовано побудову біля храму двох веж, автором проекту був Алоїз Вондрашка. У 1839 році було добудовано північну вежу з наметовим завершенням, а південну вежу збудували у 1906 р. Її спорудженням займався Владислав Галицький. Тоді ж обидві вежі отримали барокове завершення.","curaddr":"вул.Володимира Винниченка, 20. ","image":"Church of the Carmelites.png","id":10,"type_id":1,"_id":"OIibloMFLp8KLCvx"}
{"table":"arcobj","objName":"Палац Бандінеллі","descr":"Будинок побудований наприкінці XVI століття (1593 р.). На початку XVII століття купець з Флоренції (Італія) Роберто Бандінеллі, одержавши львівське громадянство, купив цей будинок і започаткував тут класичну пошту європейського зразка. 1629 року польський король Сигізмунд ІІІ Ваза надав Бандінеллі привілей на отримання регулярної королівської пошти і титул королівського поштмагістра. Львів'яни могли щосуботи відправляти й одержувати листи з усієї Європи, але ці послуги коштували досить дорого. Відправка лише шести грамів кореспонденції, наприклад до Гданська, дорівнювала денній платні кваліфікованого ремісника. Але невдовзі львівська Рада відмовилась від таких дорогих послуг. Бандінеллі вклав у цю справу немалі гроші і тому це рішення розорило його. У 1737–1739 роках будинок ґрунтовно перебудували, звівши для укріплення контрфорси. На дверних та віконних оздобах залишилися елементи різьби по білому камені. Оригінальними залишилися портал та вікна, розташовані справа й зліва від нього, обрамлені дельфінами.","curaddr":"пл.Ринок, 2.","image":"Palace of Bandinelli.png","id":15,"type_id":3,"_id":"RHj0Lx3CdMa16ppM"}
{"table":"arctype","typeName":"Оборонні споруди","id":2,"_id":"SdDddfQbk7Yw8CGD"}
{"table":"arcobj","objName":"Бернардинський костел","descr":"Бернардинський костел зводили з 1600 по 1630-ті роки на місці його дерев'яного та цегляно-дерев'яного попередників з XV ст. традиційним тоді на Русі способом — старий фахверковий костел не розбирали, а ззовні будували нові муровані стіни. Після перекриття нового костелу склепіннями старий розібрали. Архітектором був італієць Павло Римлянин — на фасаді костелу чітко прослідковується творчий почерк — звичний для нього ренесанс. Костел споруджено з тесаного каменю у вигляді тринавової базиліки з видовженими хорами та гранованою апсидою. Довжина храму 57,5 м, а висота 22 м. Головний фасад має два яруси, вирішені різними архітекторами в дещо відмінній стилістиці. Нижній ярус — в традиціях італійського ренесансу, характерного для творчої манери Павла Римлянина. Членування нижнього ярусу фасаду спареними пілястрами чітко виявляє тринавову композицію храму, в суворих і чітких формах вирішено бічні фасади. З цим контрастують ускладнені обриси й пластика фронтону — горішнього ярусу головного фасаду, виконаного Андреасом Бемером в стилістиці північного німецько-фламандського ренесансу (маньєризму). Павлу Римлянину не вдалося довести до кінця будівництво — помер у 1618 році. Учень і наступник видатного архітектора швейцарець або італієць, архітектор Амвросій Прихильний будував споруду інакше. Йому належить щит-фронтон ускладненої і вигадливої форми. Саму споруду Амброзій Прихильний будував у стилі німецько-нідерландського маньєризму. Третій ярус надбудовував Андреас Бемер — вроцлавський скульптор і архітектор; під його керівництвом завершили оздоблення храму в 1630 р. Швидше за все, йому ж належить і 38-метрова вежа костелу. На ній в 1753 році був встановлений годинник з боєм, для котрого майстер Андрій Франк відлив спеціального дзвона. Силует вежі порізаний, складний, характерно барочний, витончений і дуже гармонійний.","curaddr":"пл.Соборна, 1.","image":"Bernadine Church.png","id":4,"type_id":1,"_id":"Stzkw8Rg1PF7t0EM"}
{"table":"arcobj","objName":"Преображенська церква","descr":"Преображенська церква постала на місці костелу Тринітаріїв, котрі прибули з Іспанії і заклали свій монастир у 1703 році біля Краківської брами. За розпорядженням цісаря Йосифа у 1783 році монастир закрили, а в його приміщеннях влаштували бібліотеку та актовий зал університету. В 1848 року під час революційних подій університетські будівлі були зруйновані артилерійським вогнем та пожежею, університет перебрався на вул. Святого Миколая (тепер Грушевського), а зруйновані будівлі цісар Франц Йосиф І подарував русинам, котрі збудували тут у 1851-1864 роках Народний дім, який мав стати репрезентаційним та культурним осередком галицьких українців. А поряд на базі збережених мурів колишнього костелу тринітаріїв почалось спорудження другої (після Успенської) церкви для львівського середмістя. Аж 1874 року було затверджено проект храму, розроблений Сильвестром Гавришкевичем. Будівництво тривало двадцять років, ще кілька років велись роботи над оздобленням Преображенської церкви. В 1906 році митрополит Галицький Андрей Шептицький освятив Преображенську церкву. Преображенська церква першою в Україні повернулася в лоно греко-католицької церкви.","curaddr":"вул.Краківська, 21.","image":"Transfiguration Church.png","id":18,"type_id":1,"_id":"WgpqFkhcBCJqaYhd"}
{"table":"arcobj","objName":"Кафедральний костел","descr":"Катедра — культова споруда, римо-католицька базиліка, головний храм Львівської архідієцезії Римо-Католицької церкви в Україні. Пам'ятка сакральної архітектури XIV—XVIII століття. Протягом історії неодноразово перебудовувався і добудовувався. До сьогодні збереглось 8 добудованих каплиць навколо храму. Вежа Латинської катедри є однією з найвищих споруд центральної частини міста (66 м). Збудований із цегли двох відтінків, тинькований (цеглу демонструє зондаж на контрфорсі абсиди). Застосовано також блоки з міоценового літотамнієвого вапняку і вапнистого пісковику, які добувались в каменоломнях в околицях тодішнього Львова. Довжина храму 67 м, ширина — 23 м. Будівля тринавна, зального типу, з витягнутим пресбітерієм і гранчастою абсидою. Основний простір майже кубічний, але пізніші прибудови значно ускладнили конфігурацію храму. З обох боків до пресбітерія симетрично примикають по одному захристю та одній каплиці. У проміжках між контрфорсами до нав з північного і південного боків прибудовано по 3 каплиці. Пресбітерій та кожна з трьох нав перекриті трьома пряслами хрестових склепінь. Дах над навами та пресбітерієм — двоспадовий, над лівою дзвіницею — складний бароковий з вазонами, над недобудованою правою — пологий шатровий. На даху нави влаштовано два ряди люкарн на різній висоті. Готичну складову підкреслює високий шип даху. В інтер'єрі чотири високі сніпчасті колони підтримують стрільчаті арки і склепіння з готичними нервюрами. Стіни і склепіння вкриті численними фресками.","curaddr":"пл.Катедральна, 1.","image":"Cathedral.png","id":6,"type_id":1,"_id":"Z4aPDZZi0VOiDmeL"}
{"table":"arcobj","objName":"Палац Потоцьких","descr":"Родина Потоцьких придбала у 1822 р. нерухомість на вулиці Широкій (нині Коперника) і побудувала спочатку один, потім другий палац. Альфред Потоцький був маршалком Галицького Сейму. Протягом 1875—1883 рр. був намісником Галичини. Будівля виконана в стилі французького класицизму, цегляна, обштукатурена, Н-подібна у плані, з розвинутим центральним ризалітом та боковими крилами. Триповерхова, з мансардами. Фасади декоровані фігурними обрамленнями вікон та рустикацією, ліпними консолями балконів та балюстрадами. Парадний вхід оформлений арочним портиком з ліпниною та іонічними колонами. Ліпний декор авторства Петра Гарасимовича та, ймовірно, Леонарда Марконі. На першому поверсі розміщені парадні зали для прийому гостей, в оформленні яких широко використані ліпнина, позолота, різнокольоровий мармур, цінні породи дерева, розпис. З вулиці на подвір'я ведуть парадні монументальні ворота з двома флігелями, прикрашені картушем. Для прийомів у палаці Потоцьких були передбачені місця для під'їзду екіпажів, зали для зустрічей. Загальна площа палацу становить 3100 м².","curaddr":"вул.Коперника, 15.","image":"Palace of Potockys.png","id":17,"type_id":3,"_id":"biAP31DEcEr8nTG2"}
{"table":"arcobj","objName":"Палац Корнякта","descr":"Палац Корнякта, також Королівська кам'яниця — пам'ятка ренесансної архітектури. Купець-виноторговець, за походженням грек з острова Крит, Костянтин Корнякт, отримав дворянство з рук короля Речі Посполитої за свою вірну службу на посаді особистого королівського секретаря. Спеціальним декретом король у 1576 р. дозволив Корнякту спорудити на площі Ринок у Львові палац з 6-ма вікнами — такий привілей не можна було купити за жодні гроші, тільки отримати за особливо видатні заслуги перед містом та державою. Надзвичайною прикрасою палацу Корнякта є Італійське (або Венеційське) подвір'я, напрочуд схоже на типові дворики Флоренції і Риму. У XVIII столітті тут ставили п'єси Шекспіра. У цьому подвір'ї завдяки його унікальній акустиці в теплу пору року відбуваються традиційні концерти, фестивалі класичної і джазової музики.","curaddr":"пл.Ринок, 6.","image":"Palace of Kornyakt.png","id":16,"type_id":3,"_id":"cMVrgE1L8LNyxCMr"}
{"table":"arcobj","objName":"Домініканський костел","descr":"Готичний домініканський костел був збудований 1407 року після пожежі дерев'яного храму будівничим Миколою Чехом, можливо, з використанням мурів, фундаментів княжого палацу і каплиці. Його схему наприкінці XVI ст. намалював домініканець, мандрівник Мартін Ґруневеґ. Костел споруджений у стилі пізнього бароко за західноєвропейским зразком. Кам'яний, в плані він зображає витягнутий хрест з овальною центральною частиною і двома дзвіницями по боках. Звеличує церкву величезний еліптичний купол. Масивні здвоєні колони підтримують галереї і ложі, прикрашені дерев'яними статуями роботи львівських скульпторів другої половни 18 століття. Над галереями — колони барабана, що підтримують купол. Під банею костелу — цитата латинською мовою з Першого послання Тимофію: «Soli Deo honor et gloria» («Єдиному Богу честь і хвала»). Антоній Осінський і Матвій Полейовський виконали різьби для костелу. В інтер'єрі храму збереглися скульптури Себастьяна Фесінґера.","curaddr":"пл.Музейна, 1.","image":"Dominican Church.png","id":12,"type_id":1,"_id":"k1h3iUpcpepSvBUR"}
{"table":"arcobj","objName":"Костел Івана Хрестителя","descr":"Костел святого Івана Хрестителя, який розташовується в північно-східній частині площі Старий Ринок, є одним з найдавніших храмів Львова. Точна дата побудови святині невідома і досі є дискусійною серед дослідників історії давнього Львова. Серед можливих дат побудови фігурують такі роки - 1201, 1234, 1250, 1260, 1270 і 1370. Костел переходив з рук в руки - від католиків до вірмен-уніатів і назад, горів, руйнувався і реставрувався. Із внутрішнього облаштування костелу практично нічого не збереглося. Зараз в ньому існує музей.","curaddr":"вул.Ужгородська, 8А.","image":"Church of John the Baptist.png","id":7,"type_id":1,"_id":"pHUcEVNGHT581s48"}
{"table":"arcobj","objName":"Міський арсенал","descr":"Найдавніший міський арсенал було примуровано до 1430 р. до Низького муру. Після пожежі 1527 р. арсенал розібрали і до 1556 р. нову одноярусну будівлю арсеналу прибудували до Високого муру Львова, залишки якого видно з вулиці Арсенальної. Після нової пожежі арсенал відбудували двоярусним (1574—1575), а з 1582 при ньому облаштували людвисарню для відливання гармат. При реконструкції 1670-х років арсенал отримав третій ярус. Значно потерпів від пожежі 1703 р., коли від вибуху пороху обвалилось склепіння і утворились проломи у стінах. Будівля арсеналу виконана з каменю, двоповерхова, прямокутна в плані, з невеликою восьмикутною вежею на північній стороні. У XVIII столітті в підвалах львівського міського арсеналу тримали полонених українських козаків і гайдамаків. В одному з казематів знаходилася камера тортур і житло міського ката.","curaddr":"вул.Підвальна, 5.","image":"City Arsenal.png","id":11,"type_id":2,"_id":"r6VeyE2PiHDIS3xL"}
{"table":"arcobj","objName":"Порохова вежа","descr":"З декількох десятків потужних львівських оборонних веж, брам і бастіонів до нашого часу збереглася лише одна — Порохова вежа (1554–1556). Вона входила до третьої лінії оборони міста. Її збудували з каміння старого Міського арсеналу. Це була найпотужніша вежа, бо з цього боку під мурами міста часто зʼявлялися загарбники зі Сходу. Товщина її мурів становить 2,5-3 м, довжина вежі 24 м, ширина 19,5 м. На першому ярусі вежі було 6 гарматних бійниць, на другому 9 бійниць. На жаль не зберігся третій ярус, який мав машикулі та на 1 м нависав над нижніми ярусами і мав 13 бійниць для гаківниць.","curaddr":"вул.Підвальна, 4.","image":"Gunpowder Tower.png","id":13,"type_id":2,"_id":"y9mIbo9Q3ESdqcm3"}
