[
	{"table":"arctype", "typeName":"Цивільна архітектура", "id":3},
	{"table":"arctype", "typeName":"Церкви та монастирі", "id":1},
	{"table":"arctype", "typeName":"Оборонні споруди", "id":2},
	{"table":"arcobj", "objName":"Вірменська церква", "descr":"Вірменську церкву збудовано в 1363–1370 роках майстром Дорінгом між вищою та нижчою Вірменськими вулицями. Протягом століть вона була громадським і релігійним центром вірменської колонії у Львові. Вплив вірменської архітектури позначився на формі дванадцятигранного барабана з шатровим дахом, що вивершує середохрестя. Він виявляється в ретельному оздобленні стін тесаними кам'яними плитами з вмонтованими в них хачкарами, в рисунку сталактитового фриза над аркою центральної апсиди. Останній був прикрашений властивим для давньоруських пам'яток фресковим розписом (XV століття).", "curaddr":"вул.Вірменська, 7/13", "id":1, "type_id":1},
	{"table":"arcobj", "objName":"Успенська церква", "descr":"Побудований Успенським братством храм мав трьох своїх попередників. Перша Успенська церква існувала, можливо, ще за княжих часів і була спалена під час нападу на Львів польських феодалів у 1340 р. Друга, мурована церква, перша згадка про неї відноситься до 1421 р., проіснувала до пожежі 1527 р. Зруйнований пожежею храм відбудовує у 1547–1559 р. архітектор Петро Італієць — уродженець міста Лугано. Кошти на його спорудження дав молдавський господар Олександр Лопушанин. Вона також недовго простояла, згорівши при пожежі 1571 р.дівництво четвертої Успенської церкви, яка збереглась донині, братство розпочало в 1591 р. Автором проекту і керівником будівельних робіт був Павло Римлянин. З 1597 р. йому допомагав Войтіх Капінос, через рік приєднався Амброзій Прихильний. Спочатку церкву мурували з цегли, але після зведення частини мурів братство прийняло рішення замінити цеглу на тесаний камінь. Будівництво храму закінчили 1629 року. Структура церкви витримана у стилі італійського ренесансу, але на основі традицій українського будівництва. На осі захід-схід — тридільна і триверха, як основний тип українських дерев'яних церков. Стіни розчленовані пілястрами, з арками вікон і плоскорізьбами на метопах, різьбленими одвірками північних і південних дверей, а на парусах угорі вирізьблені герби жертводавців; різьбарські роботи виконали львівські різьбарі Костянтин і Яків Кульчицькі. 			Успенська церква — це тринавна базиліка, видовжена вздовж вул. Руської, з півкруглою апсидою, що виступає в бік вул. Підвальної. Храм увінчують три бані з ліхтарями; центральна баня спочиває на підпружних арках, підтримуваних чотирма тосканськими колонами. У такій планувально-об'ємній структурі прослідковується злиття західної ренесансної та української будівельних традицій. Перша проявилася у базилікальному плані й архітектурному декорі, друга — в традиційних купольних завершеннях. Зовні стіни відповідно до внутрішнього планування розчленовані тосканськими пілястрами на симетричні площини, у яких прорізані віконні отвори (з 4-ма вікнами вдолі і 8-ма в так званій ліхтарні, прикрашена розетами; під нею герби молдавського воєводи Мирона Бернавського-Могили, царя Фьодора Івановіча (ктиторів храму), короля Сігізмунда ІІІ Вази з архівольтами. Фасад завершено розвиненим антаблементом, компонентом якого є дорійський фриз з метопами, тригліфами та розетами. У полях метопів розміщено рельєфні, різьблені в камені композиції на біблійні та євангельські теми. В інтер'єрі храму, що складається з трьох просторових об'ємів — бабинця, головної нави та вівтарної частини, — основну естетичну роль відіграє матеріал — білий тесаний камінь при лаконічній архітектурній пластиці колон, арок, пілястр. Центральний купол, основою якого служить доричний фриз, оздоблений кесонами з розетками. В його парусах вміщено різьблені в камені герби жертводавців, які давали кошти на будівництво храму. Основою двох інших куполів — у бабинці та вівтарній частині, служить дорійський фриз з метопами та тригліфами. Стіни, як і зовні, розчленовані пілястрами, а архітектурне рішення інтер'єру збагачують два марші сходів, що ведуть на бокові галереї при північній та південній стінах. Світло в церкву потрапляє через високі вікна, оздоблені вітражами львівського художника першої третини XX ст. Петра Холодного. На стінах залишились зразки станкового живопису XVII ст.", "curaddr":"вул.Підвальна, 9", "id":2, "type_id":1},
	{"table":"arcobj", "objName":"Бернардинський костел", "descr":"Бернардинський костел зводили з 1600 по 1630-ті роки на місці його дерев'яного та цегляно-дерев'яного попередників з XV ст. традиційним тоді на Русі способом — старий фахверковий костел не розбирали, а ззовні будували нові муровані стіни. Після перекриття нового костелу склепіннями старий розібрали. Архітектором був італієць Павло Римлянин — на фасаді костелу чітко прослідковується творчий почерк — звичний для нього ренесанс.Костел споруджено з тесаного каменю у вигляді тринавової базиліки з видовженими хорами та гранованою апсидою. Довжина храму 57,5 м, а висота 22 м. Головний фасад має два яруси, вирішені різними архітекторами в дещо відмінній стилістиці. Нижній ярус — в традиціях італійського ренесансу, характерного для творчої манери Павла Римлянина. Членування нижнього ярусу фасаду спареними пілястрами чітко виявляє тринавову композицію храму, в суворих і чітких формах вирішено бічні фасади. З цим контрастують ускладнені обриси й пластика фронтону — горішнього ярусу головного фасаду, виконаного Андреасом Бемером в стилістиці північного німецько-фламандського ренесансу (маньєризму).Павлу Римлянину не вдалося довести до кінця будівництво — помер у 1618 році. Учень і наступник видатного архітектора швейцарець або італієць, архітектор Амвросій Прихильний будував споруду інакше. Йому належить щит-фронтон ускладненої і вигадливої форми. Саму споруду Амброзій Прихильний будував у стилі німецько-нідерландського маньєризму. Третій ярус надбудовував Андреас Бемер — вроцлавський скульптор і архітектор; під його керівництвом завершили оздоблення храму в 1630 р. Швидше за все, йому ж належить і 38-метрова вежа костелу. На ній в 1753 році був встановлений годинник з боєм, для котрого майстер Андрій Франк відлив спеціального дзвона. Силует вежі порізаний, складний, характерно барочний, витончений і дуже гармонійний.", "curaddr":"пл.Соборна, 1", "id":1},
	{"table":"arcobj", "objName":"Чорна кам'яниця", "descr":"Чорна кам'яниця — житловий будинок на площі Ринок у Львові, архітектурна пам'ятка. Збудована 1577 року Петром Красовським у стилі ренесансу. У 1875–1877 роках відновлено аттик і портали, 1884-го надбудовано 4-й поверх. Фасад і фланкуючі пілястри вкриті тесаним каменем. Фасад оздоблено орнаментами і сюжетною різьбою. Наприкінці XVI століття представник львівського патриціанського роду Ян Лоренцович відкрив у цьому будинку одну з перших у Львові аптек. Свою назву Чорна кам'яниця одержала у XIX столітті через цілком прозаїчну причину: протягом століть свинцеві білила, які наносилися як ґрунт для поліхромії (багатоколірності), окислювалися під дією повітря і світла і таким чином утворився її таємничий чорний колір.", "curaddr":"пл.Ринок, 8", "id":4, "type_id":3},
	{"table":"arcobj", "objName":"Міський арсенал", "descr":"Найдавніший міський арсенал було примуровано до 1430 р. до Низького муру. Після пожежі 1527 р. арсенал розібрали і до 1556 р. нову одноярусну будівлю арсеналу прибудували до Високого муру Львова, залишки якого видно з вулиці Арсенальної. Після нової пожежі арсенал відбудували двоярусним (1574—1575), а з 1582 при ньому облаштували людвисарню для відливання гармат. При реконструкції 1670-х років арсенал отримав третій ярус. Значно потерпів від пожежі 1703 р., коли від вибуху пороху обвалилось склепіння і утворились проломи у стінах.Будівля арсеналу виконана з каменю, двоповерхова, прямокутна в плані, з невеликою восьмикутною вежею на північній стороні. У XVIII столітті в підвалах львівського міського арсеналу тримали полонених українських козаків і гайдамаків. В одному з казематів знаходилася камера тортур і житло міського ката.", "curaddr":"вул.Підвальна, 5", "id":5, "type_id":2},
	{"table":"arcobj", "objName":"Порохова вежа", "descr":"З декількох десятків потужних львівських оборонних веж, брам і бастіонів до нашого часу збереглася лише одна — Порохова вежа (1554–1556). Вона входила до третьої лінії оборони міста. Її збудували з каміння старого Міського арсеналу. Це була найпотужніша вежа, бо з цього боку під мурами міста часто зʼявлялися загарбники зі Сходу. Товщина її мурів становить 2,5-3 м, довжина вежі 24 м, ширина 19,5 м. На першому ярусі вежі було 6 гарматних бійниць, на другому 9 бійниць. На жаль не зберігся третій ярус, який мав машикулі та на 1 м нависав над нижніми ярусами і мав 13 бійниць для гаківниць.", "curaddr":"вул.Підвальна, 4", "id":6, "type_id":2},
	{"table":"arcobj", "objName":"Королівський арсенал", "descr":"Зведений у 1639–1646 рр. арсенал дістав назву Королівського, оскільки 2/3 вартості будівництва сплатив король Владислав IV Ваза. Арсенал використовувався як склад міської зброї і виконував свої безпосередні функції до 1768 р. При арсеналі також діяли ливарня, у котрих відливали зброю та дзвони, а також різні майстерні. Як і Міський арсенал, Королівський був прибудований до Високого муру і входив до системи укріплень. У разі штурму арсенал ставав пасткою для тих, хто увірветься у двір, бо кожна точка подвір'я прострілюється з вікон. Будинок зведено з каменю, є прямокутним у плані з двома L-подібними крилами, з'єднані стіною. Ці стіни зі східного боку оточують внутрішнє подвір'я. Фасад, котрий виходить на площу перед арсеналом прикрашений лоджією і бароковим фронтоном. На бічному фасаді східного крила зберігся різьблений кам'яний портал у стилі ренесанс.", "curaddr":"вул.Підвальна, 13", "id":7, "type_id":2},
	{"table":"arcobj", "objName":"Палац Бандінеллі", "descr":"Будинок побудований наприкінці XVI століття (1593 р.). На початку XVII століття купець з Флоренції (Італія) Роберто Бандінеллі, одержавши львівське громадянство, купив цей будинок і започаткував тут класичну пошту європейського зразка. 1629 року польський король Сигізмунд ІІІ Ваза надав Бандінеллі привілей на отримання регулярної королівської пошти і титул королівського поштмагістра. Львів'яни могли щосуботи відправляти й одержувати листи з усієї Європи, але ці послуги коштували досить дорого. Відправка лише шести грамів кореспонденції, наприклад до Гданська, дорівнювала денній платні кваліфікованого ремісника. Але невдовзі львівська Рада відмовилась від таких дорогих послуг. Бандінеллі вклав у цю справу немалі гроші і тому це рішення розорило його. У 1737–1739 роках будинок ґрунтовно перебудували, звівши для укріплення контрфорси. На дверних та віконних оздобах залишилися елементи різьби по білому камені. Оригінальними залишилися портал та вікна, розташовані справа й зліва від нього, обрамлені дельфінами.", "curaddr":"пл.Ринок, 2", "id":8, "type_id":3},
	{"table":"arcobj", "objName":"Палац Корнякта", "descr":"Палац Корнякта, також Королівська кам'яниця — пам'ятка ренесансної архітектури. Купець-виноторговець, за походженням грек з острова Крит, Костянтин Корнякт, отримав дворянство з рук короля Речі Посполитої за свою вірну службу на посаді особистого королівського секретаря. Спеціальним декретом король у 1576 р. дозволив Корнякту спорудити на площі Ринок у Львові палац з 6-ма вікнами — такий привілей не можна було купити за жодні гроші, тільки отримати за особливо видатні заслуги перед містом та державою. Надзвичайною прикрасою палацу Корнякта є Італійське (або Венеційське) подвір'я, напрочуд схоже на типові дворики Флоренції і Риму. У XVIII столітті тут ставили п'єси Шекспіра. У цьому подвір'ї завдяки його унікальній акустиці в теплу пору року відбуваються традиційні концерти, фестивалі класичної і джазової музики.", "curaddr":"пл.Ринок, 6", "id":9, "type_id":3}
]	